{
"moduleCode": "HY4226",
"moduleTitle": "European Intellectual History",
"moduleCredit": "5",
"lockedModules":[
],
"preclusion": "EU4225",
"prerequisite": "Cohort 2011 and before Completed 80MCs, including 28 MCs in EU/ LA [French/German]/recognised modules, with a minimum CAP of 3.50 or be on the Honours track. Cohort 2012-2014 Completed 80MCs, including 28 MCs in EU/ LA [French/German]/recognised modules or 28MCs in GL/GL recognised non-language modules, with a minimum CAP of 3.20 or be on the Honours track. Cohort 2015 onwards Completed 80MCs, including 28 MCs in EU/ LA [French/German/Spanish]/ recognised modules or 28MCs in GL/GL recognised non-language modules, with a minimum CAP of 3.20 or be on the Honours track.",
"preclusionList": [
            "EU4225"
        ],
"parsedPrerequisite" : "nil",
"prerequisiteList": [],
"completePrerequisite": {
            "name": "HY4226", 
            "children": []
},
"moduleDescription": "This module will provide students with an advanced overview of the disciplines and methodology of intellectual history and also explore the major strands of European thought. At the same time, students will explore the ways in which European intellectuals have provided definition to modernity. Accordingly, tracing the many facets of criticism as they are made manifest in a number of discourses will be one of the major features of the module. Special attention will be devoted to some of the following Romanticism, liberalism, industrialization and its consequences, Marxism, the development of cultural criticism, the emancipation of women, Darwinism, secularization, the rise of psychoanalysis, the impact of World War I, the rise of fascism, the role of ideas in shaping the mid century West, and the advent of postmodernism",
        "CrossModule": "EU4225", 
"corequisite": "-1",
"faculty": "ARTS & SOCIAL SCIENCES",
"department": "HISTORY",
"history": [[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[2016,1,0,0,0]]
}
