{
"moduleCode": "UTC1702B",
"moduleTitle": "Thinking in Systems: Diseases and Healthcare",
"moduleCredit": "4",
"lockedModules":[
],
"preclusion": "FOR GEM1919 GEM-coded GEM1914 Jnr Sem: Systems Systems Everywhere GEM1915% Towards an Understanding of the Complex World GEM1918 Thinking in Systems: Ecosystems and Natural Resources GE Reform GET1011 Towards an Understanding of the Complex World UTC-coded UTC1411 Jnr Sem: Systems Systems Everywhere UTC1701 Thinking in Systems: Diseases and Healthcare UTC1700 Thinking in Systems: Ecosystems and Natural Resources FOR UTC1701 GEM-coded GEM1914 Jnr Sem: Systems Systems Everywhere GEM1915% Towards an Understanding of the Complex World GEM1918 Thinking in Systems: Ecosystems and Natural Resources GEM1919 Thinking in Systems: Diseases and Healthcare GE Reform GET1011 Towards an Understanding of the Complex World UTC-coded UTC1411 Jnr Sem: Systems Systems Everywhere UTC1700 Thinking in Systems: Ecosystems and Natural Resources",
"prerequisite" : "NIL",
"preclusionList": [
            "GEM1915",
            "GEM1914",
            "UTC1701",
            "UTC1700",
            "GEM1919",
            "GEM1918",
            "UTC1411",
            "GET1011"
        ],
"parsedPrerequisite" : "nil",
"prerequisiteList": [],
"completePrerequisite": {
            "name": "UTC1702B", 
            "children": []
},
"moduleDescription": "Does a virus attack any individual? Or, does an individual create conditions for infection? How should hospitals plan treatment strategies and patient-staff movements during an outbreak? Should government allocate more resources to prevent onset of chronic diseases rather than managing the complications arising out of chronic diseases? Students will approach such questions from a systems perspective, which involves: understanding behaviours of subsytems and stakeholders such as disease/ infection, patients, providers, payers and society. They will also learn how the interdependencies and interactions between the different actors of the system can be integrated into a holistic system that enables better understanding.",
"crossModule": "-1",
"corequisite": "-1",
"faculty": "NON-FACULTY-BASED DEPARTMENTS",
"department": "RESIDENTIAL COLLEGE 4",
"history": [[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[2016,1,0,0,0]]
}
